class exe11153{
	public static void main(String[] args) {
		 int a[] = {-2,5,4,-5};
        
        for (int i = 0 ; i < a.length ; i ++){
            if (a[i] < 0){
                a[i] = 0; 
                break;   
            }
            if(a[i] % 2 == 0){
                a[i] = 0;    
            }
            System.out.println(a[i]);
        }
  }
}
//Жиымнан жою:
//а) бірінші теріс элемент (массивтегі теріс элементтер болса
//сонда бар);
//б) соңғы жұп элементті алып тастаңыз (егер массивтегі жұп элементтер болса
//сонда бар).