class exe11150{
	public static void main(String[] args) {
		 int a[]=new int[21];
    for (int i =0;i<=20;i++){
      a[i]=i;
    }
    a[5]=0;
    int sum=0;


    for (int i=0;i<=20;i++){
       sum=sum+a[i];
      System.out.println(a[i]);
    }
    
    System.out.println(sum);
  }
}


//Массив 20 тауар түрінің әрқайсысының құны туралы ақпаратты қамтиды,
//фирма сатады. Келесі жылдың 1 қаңтарынан бастап фирма тауарды сатуды тоқтатады, оның құны массивтің n-ші элементінде жазылады. Барлық қалған тауарлар түрлерінің құны бар массив алыңыз